Public Class Form3d
    Dim rs As New FormResizer
    Private Sub Form3d_Load(sender As Object, e As EventArgs) Handles MyBase.Load
        rs.FindAllControls(Me)
        Form2nd.Close()
    End Sub
    Private Sub Form3d_Resize(sender As Object, e As EventArgs) Handles Me.Resize
        rs.ResizeAllControls(Me)
    End Sub
    Public Class FormResizer
        '----------------------------------------------------------
        ' ControlInfo
        ' Structure of original state of all processed controls
        '----------------------------------------------------------
        Private Structure ControlInfo
            Public name As String
            Public parentName As String
            Public leftOffsetPercent As Double
            Public topOffsetPercent As Double
            Public heightPercent As Double
            Public originalHeight As Integer
            Public originalWidth As Integer
            Public widthPercent As Double
            Public originalFontSize As Single
        End Structure
        '-------------------------------------------------------------------------
        ' ctrlDict
        ' Dictionary of (control name, control info) for all processed controls
        '-------------------------------------------------------------------------
        Private ctrlDict As Dictionary(Of String, ControlInfo) = New Dictionary(Of String, ControlInfo)
        '----------------------------------------------------------------------------------------
        ' FindAllControls
        ' Recursive function to process all controls contained in the initially passed
        ' control container and store it in the Control dictionary
        '----------------------------------------------------------------------------------------
        Public Sub FindAllControls(thisCtrl As Control)
            '-- If the current control has a parent, store all original relative position
            '-- and size information in the dictionary.
            '-- Recursively call FindAllControls for each control contained in the
            '-- current Control
            For Each ctl As Control In thisCtrl.Controls
                Try
                    If Not IsNothing(ctl.Parent) Then
                        Dim parentHeight = ctl.Parent.Height
                        Dim parentWidth = ctl.Parent.Width
                        Dim c As New ControlInfo
                        c.name = ctl.Name
                        c.parentName = ctl.Parent.Name
                        c.topOffsetPercent = Convert.ToDouble(ctl.Top) / Convert.ToDouble(parentHeight)
                        c.leftOffsetPercent = Convert.ToDouble(ctl.Left) / Convert.ToDouble(parentWidth)
                        c.heightPercent = Convert.ToDouble(ctl.Height) / Convert.ToDouble(parentHeight)
                        c.widthPercent = Convert.ToDouble(ctl.Width) / Convert.ToDouble(parentWidth)
                        c.originalFontSize = ctl.Font.Size
                        c.originalHeight = ctl.Height
                        c.originalWidth = ctl.Width
                        ctrlDict.Add(c.name, c)
                    End If
                Catch ex As Exception
                    Debug.Print(ex.Message)
                End Try
                If ctl.Controls.Count > 0 Then
                    FindAllControls(ctl)
                End If
            Next '-- For Each
        End Sub
        '----------------------------------------------------------------------------------------
        ' ResizeAllControls
        ' Recursive function to resize and reposition all controls contained in the Control
        ' dictionary
        '----------------------------------------------------------------------------------------
        Public Sub ResizeAllControls(thisCtrl As Control)
            Dim fontRatioW As Single
            Dim fontRatioH As Single
            Dim fontRatio As Single
            Dim f As Font
            '-- Resize and reposition all controls in the passed control
            For Each ctl As Control In thisCtrl.Controls
                Try
                    If Not IsNothing(ctl.Parent) Then
                        Dim parentHeight = ctl.Parent.Height
                        Dim parentWidth = ctl.Parent.Width
                        Dim c As New ControlInfo
                        Dim ret As Boolean = False
                        Try
                            '-- Get the current control's info from the control info dictionary
                            ret = ctrlDict.TryGetValue(ctl.Name, c)
                            '-- If found, adjust the current control based on control relative
                            '-- size and position information stored in the dictionary
                            If (ret) Then
                                '-- Size
                                ctl.Width = Int(parentWidth * c.widthPercent)
                                ctl.Height = Int(parentHeight * c.heightPercent)
                                '-- Position
                                ctl.Top = Int(parentHeight * c.topOffsetPercent)
                                ctl.Left = Int(parentWidth * c.leftOffsetPercent)
                                '-- Font
                                f = ctl.Font
                                fontRatioW = ctl.Width / c.originalWidth
                                fontRatioH = ctl.Height / c.originalHeight
                                fontRatio = (fontRatioW +
                            fontRatioH) / 2 '-- average change in control Height and Width
                                ctl.Font = New Font(f.FontFamily,
                            c.originalFontSize * fontRatio, f.Style)
                            End If
                        Catch
                        End Try
                    End If
                Catch ex As Exception
                End Try
                '-- Recursive call for controls contained in the current control
                If ctl.Controls.Count > 0 Then
                    ResizeAllControls(ctl)
                End If
            Next '-- For Each
        End Sub
    End Class

    Private Sub Form3_Load(sender As Object, e As EventArgs) Handles MyBase.Load

    End Sub

    Private Sub Button1_Click(sender As Object, e As EventArgs) Handles Button1.Click

        'ΕΛΕΓΧΟς ΓΙΑ ΚΕΝΟ 
        If TextBox1.Text = "" Then
            MessageBox.Show("ΑΠΑΙΤΕΙΤΑΙ ΕΝΑ ΟΝΟΜΑ ΓΙΑ ΝΑ ΔΩΘΕΙ Ο ΣΧΕΤΙΚΟΣ ΧΡΗΣΜΟΣ!")
            Exit Sub
        End If


        Dim tuxaies_apanthseis = {"", " ~ Ο Τρελός ~ Συμβολίζει την αρχέγονη και απεριόριστη ενέργεια , την απόλυτη ελευθερία, το χάος και την βασική δημιουργική παρόρμηση. «Τρέλα»  για τον μέσο άνθρωπο σημαίνει το ακατανόητο, το απρόβλεπτο, αυτό που δεν μπορεί να ενταχθεί μέσα σε συνηθισμένα λογικά όρια. Στην κατηγορία αυτή μπορεί να ανήκει τόσο ένας ψυχικά διαταραγμένος, ένα αθώο νήπιο με την αδιαμόρφωτη ακόμα σκέψη, όσο και ένας σοφός, ο οποίος υπερέβη τους κανόνες της κοινής λογικής και συμπεριφοράς. Αφετηρία και πέρας της εξελικτικής διαδικασίας. Πρέπει να χαθεί η μαγική ακαθόριστη αθωότητα και μέσα από πολλές μυητικές προσπάθειες να ξανακατακτηθεί σ' ένα υψηλότερο επίπεδο συνειδητοποίησης.  ",
            " ~ Ο Μάγος ~ Ο μαθητευόμενος Αλχημιστής  αποφασίζει να αναλάβει το Μεγάλο έργο. Ο άνθρωπος έχει χάσει την άμεση σύνδεση με την Πηγή και πρέπει να στηριχθεί στα δικά του νοητικά εφόδια, για να συνθέσει τον κόσμο του και να βρει τις απαντήσεις που ψάχνει. Ανάμεσα στα εργαλεία του διακρίνουμε τα τέσσερα βασικά : τη Γνώση-σοφία, την τόλμη, τη θέληση και τη Σιωπή. Ο Μάγος θέλει να κατεβάσει την θεϊκή ενέργεια στη γη. Επικοινωνεί με τον ουρανό, αλλά λειτουργεί και στην ανθρώπινη διάσταση. Ο Μάγος συγκεντρώνει την ενέργεια του στο τραπέζι μπροστά του, έχοντας ένα καθορισμένο πεδίο δράσης και ένα συγκεκριμένο σχέδιο, δημιουργεί χειροπιαστό έργο εκμεταλλευόμενος τις δυνατότητες του. Είναι η επίγνωση της δύναμης μας και η θέληση να την κατευθύνουμε σ' ένα συγκεκριμένο στόχο δρώντας συνειδητά. Αρσενική αρχή, γνώση και δύναμη. YANG, Animus, Εξωστρέφεια. ",
            " ~ Η Αρχιέρεια ~ Θηλυκή αρχή, Σελήνη , υπομονή, κατανόηση, διαίσθηση, δεκτικότητα, ενδοστρέφεια. Δύναμη του νερού. YIN. Είναι μια πρόκληση να ανασύρουμε την Αρχιέρεια από τα σκοτάδια του υποσυνείδητου και να καταστήσουμε τις ιδιότητες, που εκπροσωπεί, ισότιμες της αρσενικής φύσης Anima. Μπορεί να μας βοηθήσει, ώστε να μπούμε στο άδυτο των μυστηρίων, που βρίσκονται πίσω από το πέπλο στην πλάτη της. Κρατά ένα  κλειστό πάπυρο, που συμβολίζει την εσωτερική γνώση που έχουμε ξεχάσει, χαμένοι μέσα στη καθημερινότητα μας. Θα πρέπει να εμπιστευτούμε τη διαίσθηση μας και να ψάξουμε στο υποσυνείδητο, όπου όλη η γνώση είναι διαθέσιμη, αν και όχι άμεσα προσβάσιμη. Η ερμηνεία των ονείρων, ο διαλογισμός, η παρατήρηση των συμπτώσεων στη ζωή μας είναι μερικοί από τους τρόπους που μπορούμε να ακολουθήσουμε. ",
            " ~ Η Αυτοκράτειρα ~ Αυτή η γυναίκα έχει γήινη εξουσία. Αυτό που πρεσβεύει είναι η δύναμη της αγάπης. Η σελήνη είναι στη γέμιση, ένδειξη ανάπτυξης και γονιμότητας. Είναι μια εξωστρεφής και προσγειωμένη μορφή, έτοιμη για δράση, είναι το αρχέτυπο της Μητέρας. Η δημιουργική δύναμη συνδυάζεται με τη διαίσθηση κι αποκτά υπόσταση η Αυτοκράτειρα. Δίνει υλική υπόσταση στο συνδυασμό της αρσενικής και θηλυκής ενέργειας. Το μήνυμα της είναι η παγκόσμια αγάπη, που ισορροπεί τα αντίθετα. Μεταφέρει τους σπόρους για να γεννηθεί η καινούργια επίγνωση, που θα συνδέει τον μυστικισμό με την επιστήμη και το πνεύμα με τη σάρκα. Οι σπόροι αυτοί θα δοκιμαστούν στο κόσμο της λογικής και αν περάσουν τις δοκιμές, θα δώσουν καρπό. ",
            " ~ Ο Αυτοκράτορας ~ Προσγειωμένη λογική που βάζει τάξη, φτιάχνει έργα και προστατεύει το βασίλειο. Δείχνει τις ιδιότητες της αυτοπειθαρχίας και αποφασιστικότητας συνδυασμένες με πάθος και ενθουσιασμό. Υπάρχουν ρεαλισμός, πρακτικό πνεύμα και ξεκάθαρες απόψεις. Ο Αυτοκράτορας ολοκληρώνει μία φάση, όντας το αποτέλεσμα όσων προϋπήρξαν και ξεκινάει μια καινούργια φάση ανάπτυξης. Με την ενέργεια του χτίζουμε οργανωμένες κοινωνίες και χαράζουμε σύνορα που μας δίνουν προστασία, αλλά παράλληλα μας απομονώνουν. Στο εσωτερικό τοπίο, το εγώ ισχυροποιείται σε σχέση με το εμείς και ο άνθρωπος παύει να έχει την εμπειρία του εσωτερικού του πνεύματος.  ",
            " ~ Ο Ιεροφάντης ~ Συνδέει τον εσωτερικό με τον εξωτερικό κόσμο, αλλά έχει αυστηρά καθορισμένο τελετουργικό και δοκιμασμένες πρακτικές. Ο Ιεροφάντης έχει σχηματοποιημένες ιδέες και φανερά εκφρασμένο δόγμα. Διεκδικεί την ευθύνη για την πνευματική μας ανάπτυξη και ερμηνεύει τον νόμο του Θεού. Συμβολίζει την προσπάθεια του ανθρώπου να ενωθεί με το θείο, που τον ξεχωρίζει από τα άλλα δημιουργήματα του κόσμου αυτού. Η εσωτερική αναζήτηση του Θεού μέσα μας είναι ένα πολύ δύσκολο μονοπάτι, χωρίς κάποιον οδηγό να δείχνει το δρόμο. Όντας ο εκπρόσωπος του δόγματος απαιτεί υπακοή, αυστηρότητα, δογματισμό και κάποτε φέρνει τον φανατισμό. ",
            " ~ Οι Εραστές ~ Οι Εραστές βρίσκονται μπροστά σε δίλημμα. Ο δρόμος της  ασυνείδητης επιλογής, εκεί που ενστικτωδώς τείνουμε, αφού φαίνεται πιο ευκολοδιάβατος. Κι ο δρόμος προς το άγνωστο, που χρειάζεται τόλμη και συνειδητή επιλογή. Ο Δρόμος της καρδιάς, του Dharma κι όχι του εύκολου υπολογισμού. Δεν υπάρχει καμιά ανώτερη αρχή να ζητήσουν βοήθεια, πρέπει να στηριχτούν στις δυνάμεις τους, να πάρουν τις δικές τους αποφάσεις και να αποδεχτούν την ευθύνη για τις όποιες επιπτώσεις. Ο ατομικός εαυτός αναπτύσσεται κι εξωτερικεύεται και μαζί γίνονται φανερά τα προβλήματα, τα διλήμματα, οι ενδοιασμοί και η σύγχυση του κόσμου μας. Αυτά τα «εμπόδια» είναι απαραίτητα προκειμένου να επιτευχθεί η οποιαδήποτε ανάπτυξη, αφού μόνο έτσι γνωρίζουμε πραγματικά τον εαυτό μας, ξεπερνάμε τους περιορισμούς μας. Για τον λόγο αυτό δεν έχει τόση σημασία ποιον δρόμο θα διαλέξουν οι Εραστές, το σημαντικότερο είναι να βαδίσουν προς τα εκεί με το σύνολο του εαυτού τους ενωμένοι, σώμα, καρδιά και νους μαζί! ",
            " ~ Το Άρμα ~ Ιδανικά, θα πρέπει ο νους να κυβερνάει τα συναισθήματα κι έτσι να ελέγχει το σώμα. Έτσι, συμβολίζει κυρίως τον θρίαμβο του νου, το ξεπέρασμα των αντιφάσεων και τον ισχυρό χαρακτήρα που πετυχαίνει τον έλεγχο πάνω στις διαφορετικές παραμέτρους της ζωής μας. Η περίοδος της αναζήτησης και της εφηβείας έχει πια τελειώσει. Ο νεαρός άνθρωπος, ενήλικος πια, ξεκινάει το ταξίδι του με αποφασιστικότητα και θέληση προκειμένου να διεκδικήσει το θέση που του αξίζει και είναι πλέον οι πράξεις αυτές που θα δείξουν το κατά πόσο έχει αφομοιώσει τα μαθήματα. Η γνώση και η επιτυχία του είναι ακόμα σε εξωτερικό επίπεδο. ",
            " ~ Η Δύναμη ~ Η δύναμη της γυναίκας αυτής βρίσκεται στα χέρια της, στην άμεση επαφή και δεν έχει ανάγκη από εξωτερικά βοηθήματα. Έχοντας καταφέρει να δαμάσει τον βασιλιά των ζώων, έχει απορροφήσει τη δύναμη του κι έχει γίνει η ίδια βασίλισσα. Είναι αξιοσημείωτη η σιγουριά που έχει στον εαυτό της, αφού έχει απόλυτη ηρεμία και άνεση, αντιστρόφως ανάλογη με τη δυσκολία του κατορθώματος που έχει μόλις επιτελέσει. Η πραγματική Δύναμη δεν βρίσκεται στους δυνατούς μυς, αλλά στην εκδήλωση της θηλυκής-ψυχικής μας δύναμης. Το λιοντάρι, σαν άγριο ζώο που είναι, συμβολίζει κατάλληλα την κυριαρχία του ενστίκτου, αφού ζει με βάση τις παρορμήσεις της στιγμής. Με την κάρτα της Δύναμης λοιπόν μπορούμε να αναγνωρίσουμε την σκοτεινή πλευρά μας, να την δαμάσουμε και να γευτούμε τα δώρα της. ",
            " ~ Ο Ερημίτης ~ Δεν είναι απλά ο αναζητητής, αλλά ο θριαμβευτής που επιδεικνύει τον θρίαμβο του. Η γνώση που πρεσβεύει δεν μπορεί να βρεθεί στα βιβλία, αφού είναι καθαρά βιωματική και αποτέλεσμα της εσωτερικής αναζήτησης. Συνήθως ψάχνουμε τη λύση έξω από μας. Ο Ερημίτης έρχεται να μας δείξει, ότι μόνο ο δρόμος της αυτογνωσίας μπορεί να βγάλει τον άνθρωπο από τα αδιέξοδα του. Μας καλεί να στραφούμε προς τα μέσα και να αναγνωρίσουμε την κρυμμένη ουσία μας, που περιμένει τις δικές μας συνειδητές προσπάθειες ώστε να αναπτυχθεί. Σαν λύση στο αδιέξοδο, ο Ερημίτης προτείνει την ξεχασμένη τέχνη της απομόνωσης, αντί αυτού που κατ' ευφημισμό ονομάζουμε κοινωνικότητα, έτσι ώστε να ξεκινήσουμε την επώδυνη διαδικασία του «γνώθι σ' εαυτόν» που είναι μονόδρομος προκειμένου να αποκτήσει νόημα η ζωή μας. Aποτελεί ένα στάδιο στο ταξίδι μας, που αν το περάσουμε με επιτυχία θα μπορέσουμε να συνεχίσουμε έχοντας αποκτήσει σημαντικά εφόδια, όπως την αυτάρκεια εαυτού, την ανάδειξη του πραγματικού εαυτού και των δυνατοτήτων που δεν τολμάμε να πιστέψουμε ότι έχουμε. ",
            " ~ Ο Τροχός της Τύχης ~ Ο Τροχός γυρίζει αιώνια και τίποτα σταθερό δεν μπορεί να υπάρξει, όσο η επίγνωση μας περιορίζεται στην επιφάνεια των πραγμάτων. Mας φέρνει αντιμέτωπους με το πανάρχαιο δίλημμα της μοίρας, απέναντι στην ελεύθερη βούληση. Ο κύκλος είναι ένα συνεχές, όπου το παρελθόν καθορίζει το παρόν και το παρόν καθορίζει το μέλλον. Έτσι, αν θέλουμε να βρούμε ένα σταθερό σημείο δεν έχουμε παρά να προσπεράσουμε την επιφανειακή όψη των πραγμάτων, την ψευδαίσθηση της γραμμικής πορείας του χρόνου. Χρειάζεται απόσπαση από τη συνεχή ροή γεγονότων και εντυπώσεων, για να αποκτήσουμε συνολική εικόνα του Τροχού και του σταθερού του κέντρου. Ο άνθρωπος νομίζει ότι με τις αισθήσεις και τη λογική του μπορεί να κατανοήσει όλα όσα είναι δυνατόν να κατανοηθούν. Όλα τα υπόλοιπα τα φορτώνει στη Τύχη ή στη Μοίρα. Αρνείται δηλαδή να δεχτεί ότι τα γεγονότα που συμβαίνουν στη ζωή του έχουν κάποια σύνδεση και κάποια αιτία που απλά ξεπερνάει την περιορισμένη αντιληπτική του ικανότητα. Όσο όμως διατηρεί την αλαζονική αυτή στάση, θα βρίσκεται αιώνια δεμένος στο Τροχό της Τύχης, βιώνοντας επιφανειακές χαρές και λύπες. Χρειάζεται μεγάλη προσπάθεια για να μπορέσει να εκμεταλλευτεί την ζωική ενέργεια, μετασχηματίζοντας την ενστικτώδη αντίδραση σε συνειδητή δράση. Έχουμε την ευκαιρία για βαθιά επίγνωση της ζωής μας και τελικά υπέρβαση της διαρκούς επανάληψης των φαινομένων που βιώνουμε. Αρκεί να ξεφύγουμε από τη λογική της γραμμικής πορείας του χρόνου, που είναι η φυλακή μας, και να βιώσουμε τις διαφορετικές καταστάσεις σαν ένα συνεχές παρόν, καλωσορίζοντας τα γυρίσματα της Τύχης, όχι λόγω μοιρολατρίας αλλά αναγνωρίζοντας ότι κάθε στιγμή της ζωής μας περικλείει ταυτόχρονα και το καλό και το κακό. Ουσιαστικά είναι η στάση μας κι όχι το εξωτερικό γεγονός καθαυτό που χαρακτηρίζει την κάθε στιγμή και η θετική στάση είναι η καλύτερη εγγύηση για να βελτιώσουμε τη ζωή μας και έλκοντας έτσι τις καταστάσεις, που θα μας βοηθήσουν να προχωρήσουμε στη ζωή μας. ",
            " ~ Η Δικαιοσύνη ~ Ο άνθρωπος αναλαμβάνει ενεργό ρόλο στη δημιουργία του κόσμου, ψάχνει για την εσωτερική κατανόηση των εξωτερικών φαινομένων κι έχει την ωριμότητα να αναζητήσει το νόημα της ύπαρξης του. Η Δικαιοσύνη θα ζυγίσει το παρελθόν μας και, αν είμαστε άξιοι, θα μας επιτρέψει να συνεχίσουμε το ταξίδι της εσωτερικής κατανόησης και ανάπτυξης. Το σπαθί θα χρησιμεύσει στο να διαχωρίσει την φαντασία από την πραγματικότητα, το ψεύτικο από το αληθινό και τη σύγχυση από την αντικειμενική γνώση. Η κάρτα της Δικαιοσύνης μας θυμίζει την ανάγκη για ισορροπία και αρμονία στη ζωή μας. ",
            " ~ Ο Κρεμασμένος ~ Έχει τη δύναμη να αναποδογυρίσει την οπτική του, να δει τον κόσμο ανάποδα. Σκοπός της στάσης αυτής δεν είναι τόσο η τιμωρία, όσο η προσπάθεια να χάσει ο Κρεμασμένος τον καθωσπρέπει εαυτό του και τον ισχυρό εγωισμό του. Πιθανώς, έστω και ασυναίσθητα, να έχει επιθυμήσει και ο ίδιος να βρεθεί στη θέση αυτή. Ίσως να συνειδητοποίησε ότι, πλέον ο κύκλος της κυριαρχίας πάνω στον υλικό κόσμο έχει κλείσει και τώρα πρέπει να αναζητήσει την προσωπική του ανάπτυξη σε διαφορετική διάσταση. Έτσι, έχει βρεθεί κρεμασμένος ανάποδα, με τα χέρια δεμένα στη πλάτη, πλήρως αβοήθητος και καταδικασμένος στην ακινησία. Μια καινούρια εμπειρία και μια δύσκολη αρχή. Φαίνεται να έχει επίγνωση της θέσης και να την έχει αποδεχτεί. Η οπτική του έχει αντιστραφεί και αρχίζει να ανακαλύπτει την διάσταση του βάθους. Έχει καταλάβει ότι για να βρει την ισορροπία, θα πρέπει κάτι να θυσιάσει. Οι κορμοί δέντρου που τον κρατάνε κρεμασμένο σχηματίζουν ένα είδος φέρετρου, ενώ με το κεφάλι του κάτω από το επίπεδο του εδάφους, βιώνει ένα συμβολικό «βάπτισμα» σε μια καινούργια ζωή, μια αναζήτηση του υπερβατικού. Ο ήρωας αποφάσισε να βάλει το κεφάλι του στο χώμα και να δει τον κόσμο ανάποδα, να μείνει ακίνητος, απορρίπτοντας τον κόσμο της δράσης, σαν ένα είδος προδότη για την κατεστημένη τάξη των πραγμάτων και να φαίνεται γελοίος, περιθωριακός και απροσάρμοστος. Αυτό που βιώνει δεν είναι μια τιμωρία, αλλά μια δοκιμασία απαραίτητη για τη μύηση του σ' έναν καινούργιο κόσμο. Φυσικά η διαδικασία της μύησης είναι επώδυνη, αφού για να ξεκινήσει την καινούρια ζωή του θα πρέπει να αλλάξει σαν άνθρωπος αφήνοντας πίσω του ότι περιττό κουβαλάει, όπως ο καθωσπρέπει εαυτός του, που πρέπει να γελοιοποιηθεί στα μάτια των άλλων για να ξεφουσκώσει ο εγωισμός του και να μπορέσει να κάνει μια καινούργια αρχή όσο πιο καθαρός και ελαφρύς γίνεται. ",
            " ~ Ο Θάνατος ~ Αυτό που συμβολίζει ο Θάνατος δεν είναι το οριστικό τέλος. Στη φύση ο θάνατος είναι μια συνεχής διαδικασία, άρρηκτα δεμένη με τον κύκλο της γέννησης και της φθοράς. Μόνο ο άνθρωπος που δεν έχει τη δυνατότητα να φιλοσοφήσει πάνω στο θάνατο, βλέπει τη ζωή σαν μια γραμμική πορεία η οποία κάποια στιγμή φτάνει στο τέρμα της. Αυτό που δείχνει ο Θάνατος δεν είναι το τέρμα, αλλά αυτό που συχνά λέμε το «ταξίδι χωρίς γυρισμό», ένα στάδιο απ' όπου δεν υπάρχει επιστροφή, χωρίς να σημαίνει ότι το ταξίδι τελειώνει εκεί. Ο άνθρωπος αφήνει πίσω του όλα όσα αποτελούσαν τον παλιό του εαυτό (ιδέες, πράξεις, πιστεύω) για να ξεκινήσει την καινούργια του πορεία με όσο το δυνατόν λιγότερο φορτίο. Φυσικά είναι δύσκολο και είναι λογικό ένα τέτοιο πέρασμα να συνοδεύεται από πόνο, θλίψη και θρήνο, που όμως πρέπει να οδηγούν στην αποδοχή του αναπόφευκτου: Για να γεννηθεί το καινούργιο θα πρέπει να πεθάνει το παλιό. Κι όχι μόνο απλά να πεθάνει, αλλά θα πρέπει τα σώματα να αποσυντεθούν, οι ιδεολογίες να αμφισβητηθούν, τα πιστεύω να ανατραπούν. Μόνο έτσι ο θάνατος μιας γενιάς μπορεί να γίνει το γόνιμο έδαφος, όπου θα ανθίσει ο σπόρος της επόμενης. Αυτή η σκληρή πραγματικότητα του Θανάτου είναι το νόμισμα που θα πρέπει να πληρωθεί στον Χάροντα, για να περάσουμε στην απέναντι πλευρά του ποταμού και να συνεχίσουμε το ταξίδι μας. Η στιγμή του θανάτου είναι η στιγμή του θερισμού, όπου ό,τι δημιουργήσαμε στη ζωή μας μαζεύεται και πιθανότατα καθορίζει την πορεία μας στην απέναντι πλευρά. ",
            " ~ Η Σωφροσύνη ~ Αντί να εκμηδενίσει τη ζωή ο θάνατος την ανανεώνει συνεχώς, διαλύει το περιέχον για να ελευθερώσει το περιεχόμενο, που μπορεί να συμβολιστεί ως ένα υγρό συνεχώς μεταγγιζόμενο από ένα δοχείο σε ένα  άλλο. Το κλειδί ερμηνείας της κάρτας βρίσκεται στην μετάγγιση του ζωτικού υγρού από ένα ασημένιο αμφορέα σε ένα χρυσό, από την Σωφροσύνη, που γίνεται ο Άγγελος της Συμπαντικής Ζωής. Φέρνει σε αρμονία τις ενέργειες ή ρευστά του ανθρώπου. Χάριν της παρέμβασής της δεν υπάρχουν πια αντικρουόμενες ενέργειες, δεν υπάρχουν πια αντιθέσεις αλλά μόνο συμπληρωματικά ρεύματα: είναι το μυστικό της εναρμόνισης και της ισορροπίας. Δείχνει την επανάκτηση της υγείας, την νοητική και συναισθηματική ισορροπία, τον έλεγχο των παθών, όχι με την καταπίεση, αλλά μέσα από την εξιδανίκευση. Συνήθως, ζούμε σε εσωτερική σύγκρουση και αντίφαση μεταξύ των κέντρων. Για να πετύχει η σύνθεση θα πρέπει να αποφευχθεί κάθε υπερβολή. ",
            " ~ Ο Εωσφόρος ~ Ο άνθρωπος που έχει προχωρήσει στην Ατραπό της γνώσης, φθάνει σε ένα σημείο που μπαίνει στον πειρασμό να αισθανθεί ότι είναι εκλεκτός και ότι μπορεί να χρησιμοποιήσει τις δυνάμεις του (Shiddi) για να χειραγωγήσει τους ανθρώπους προς δική του δόξα. Ο αναζητητής θα πρέπει να κατέβει στην άβυσσο του ασυνειδήτου του τόσο ατομικού, όσο και συλλογικού και να κόψει τις αλυσίδες, που μπορεί ακόμη να τον συνδέουν εν αγνοία του με εγωιστικά κίνητρα. Είναι το τελευταίο προπύργιο της διαχωριστής ατομικότητας, που αντιστέκεται στην διάλυσή της στη συμπαντική συνειδητότητα. Το εγώ κρύβεται και φαίνεται να συνεργάζεται στα πρώτα στάδια της έρευνας για να πνευματοποιηθεί, ως τελευταία προσπάθεια επιβίωσής του. Απολαμβάνει τα πνευματικά αγαθά, έτσι όπως απολάμβανε τα υλικά και φουσκώνει μέσα από τις πνευματικές του επιδώσεις που εκμεταλλεύεται δεόντως. Ο ήρωάς μας πρέπει να συναντήσει στα βάθη του ασυνειδήτου τον (Μινώταυρο) σκοτεινό άρχοντα αυτού του υλικού κόσμου και να τον νικήσει. Είναι η μεγάλη δοκιμασία της πνευματικής μας προόδου. Με την έννοια αυτή ο Διάβολος είναι εξουσιοδοτημένος συνεργάτης του Θεού, αφού στέκει στην έξοδο του κάτω κόσμου και σαν τον κέρβερο δεν επιτρέπει στους αμύητους και ανεπαρκείς να διαβούν το κατώφλι του πνευματικού κόσμου. Μια δεύτερη προσέγγιση μπορεί να είναι η Ταντρική, της ολικής αποδοχής και της πνευματοποίησης της ύλης. Συνολικά η μορφή του Διαβόλου δεν προκαλεί κάποιο ιδιαίτερο φόβο. Αυτό δεν είναι τυχαίο αφού σκοπός του δεν είναι να μας τρομάξει, αλλά να μας βάλει σε πειρασμό, να μας ξεγελάσει ώστε τελικά να δεθούμε με τις αλυσίδες του χωρίς επίγνωση της θέσης μας. Στοχεύει στην ενστικτώδη φύση μας, που ρέπει προς την απληστία και την εύκολη απόλαυση. ",
            " ~ Ο Πύργος ~ Η κατασκευή ενός Πύργου δείχνει, συμβολικά, τη προσπάθεια του ανθρώπου να φτάσει στον ουρανό, πέφτοντας στο αμάρτημα της ύβρις. Ο κεραυνός εκπορεύεται από τον πραγματικό ήλιο και βέβαια η κάρτα έχει σαφή αναφορά στο «πύργο της Βαβέλ». Ο Πύργος είναι μια φυλακή, όπως πολύ συχνά όλα τα τείχη που χτίζουμε γύρω μας για προστασία. Όσο ψηλώνει ο πύργος, τόσο ενισχύεται ο εγωισμός του και νοιώθει ανώτερος από τους συνανθρώπους του, τους οποίους κοιτάζει «αφ' υψηλού» στο κατασκεύασμα της πλάνης του. Η απόσταση του από τη γη μεγαλώνει και μαζί απομακρύνεται η δυνατότητα να πατήσει σταθερά τα πόδια του στο χώμα, ώσαν μέρος της φύσης. Αυτό που φαντάζει καταστροφή ή χτύπημα της μοίρας, δεν είναι παρά μια καινούργια πραγματικότητα. Μια τέτοια αλλαγή στην ανθρώπινη συνειδητότητα δεν γίνεται ομαλά, αφού η διάλυση των ψευδαισθήσεων συνήθως προκαλείται από ξαφνικά γεγονότα που μας κάνουν να δούμε την αλήθεια που πριν αγνοούσαμε. Όμως όσο βίαιη κι αν είναι η αλλαγή, θα πάρει όλα όσα είναι πια άχρηστα, από τα οποία μόνοι μας δεν μπορούσαμε να αποδεσμευτούμε. Έτσι, χρειάζεται θετική στάση και καλωσόρισμα της αλλαγής, που θα μας ανοίξει ένα καινούργιο δρόμο, βοηθώντας την εξέλιξη μας.  ",
            " ~ Το Αστέρι ~ Ήρεμη, θηλυκή ενέργεια. Το οχτάκτινο αστέρι έχει χρησιμοποιηθεί σαν σύμβολο της θεάς Αφροδίτης και ο πλανήτης Αφροδίτη είναι το πρωινό αστέρι, ο αυγερινός, που λάμπει την αυγή στον ανατολικό ορίζοντα και προαναγγέλλει τον ερχομό του ήλιου. Τα αστέρια φωτίζουν απαλά. Παραδοσιακά βοηθάνε ναυτικούς και ταξιδιώτες να βρούνε το δρόμο τους και να χαράξουν πορεία. Η γυναίκα της κάρτας βρίσκεται υπό το φως των αστεριών, έχοντας βγάλει από πάνω της κάθε μορφή εγωισμού και αποδεχόμενη ότι η μοίρα της είναι δεμένη με τη μοίρα του σύμπαντος. Το Αστέρι, όπως και ο Υδροχόος, ανοίγουν νέους ορίζοντες στον άνθρωπο ανατρέποντας αυτά που θεωρούσε προφανή. Μπορούμε να πούμε ότι βρισκόμαστε πίσω από το πέπλο της Αρχιέρειας, έχοντας αποκτήσει επαφή με τα νερά του ασυνειδήτου, αλλά χωρίς να τα έχουμε διαπεράσει. Υπερβαίνουμε το επίπεδο της γης, αρχίζοντας να λειτουργούμε στο κοσμικό επίπεδο. Η συνείδηση έχει φωτιστεί από το αιώνιο φως των αστεριών και έχει επέλθει κατανοήση τη θέσης μας σαν αδιάσπαστο μέρος της κυκλικής εξέλιξης του κόσμου. Η κάρτα του Αστεριού δείχνει ελπίδα και αισιοδοξία που στηρίζεται όχι στη δράση, τη λογική ή τη συνειδητή προσπάθεια, αλλά στην πίστη για την αρμονία του σύμπαντος και την παράδοση στους αιώνιους νόμους του. ",
            " ~ Η Σελήνη ~ Ένα κρίσιμο πέρασμα αναμέτρησης με τα τέρατα που βρίσκονται στο ασυνείδητο. Την τελική δοκιμασία πριν τη συνείδηση του Ήλιου. Μια βουτιά στα βαθιά νερά που απλώνονται, σαν ένα άλλο βάπτισμα στην αρχική πηγή της δημιουργίας, και συνάντηση με αρχέγονους φίλους, όντα κάποτε στο ίδιο επίπεδο εξέλιξης. Η ανθρώπινη λογική και διανόηση δεν έχει θέση στην κάρτα αυτή, παρά μόνο το ζωικό ένστικτο. Αν δαμαστούν τα τέρατα που θα βρεθούν, αν ξαναγίνουν φίλοι, τότε έχουν ολοκληρωθεί οι δοκιμασίες της Σελήνης και ο δρόμος συνεχίζεται αξιοποιώντας το τεράστιο δυναμικό που βρίσκεται στο ασυνείδητο του κάθε ανθρώπου, πίσω από το πέπλο. Πλέον δεν υπάρχει επιστροφή. Η κάρτα της Σελήνης δείχνει την πρόθεση του ανθρώπου να εγκαταλείψει τη διανοητική λειτουργία του λογικού του νου, ώστε να εμπιστευτεί τη διαίσθηση και το ένστικτο. Έτσι η ζωή του γίνεται πιο πλούσια, ταυτόχρονα όμως και πιο επικίνδυνη, αφού μπορεί να πέσει θύμα των ψευδαισθήσεων και της αυταπάτης. Ο κόσμος της νύχτας κρύβει κινδύνους και όποιος αποφασίζει να βγει έξω, ενώ το φως το ήλιου (της συνειδητότητας) απουσιάζει, πρέπει να έχει όλες τις αισθήσεις του σε λειτουργία, ώστε να λαμβάνει τα μηνύματα του περιβάλλοντος, αλλά επίσης θα πρέπει να έχει πλήρη επίγνωση της κάθε του κίνησης. ",
            " ~ Ο Ήλιος ~ Χαρίζει φως και ζεστασιά, καθώς διαδέχεται τη σκοτεινή και κρύα Σελήνη στον καθημερινό χορό τους στον ουρανό. Είναι παιδιά, που συμβολίζουν τη γέννηση μιας καινούργιας συνειδητότητας ελεύθερη από δεσμεύσεις και προκαταλήψεις του παρελθόντος. Έτσι το φως της καινούργιας μέρας στον ουρανό, έχει το αντίστοιχο του στη γη με μια καινούργια αρχή που κάνει ο άνθρωπος. Τα παιδιά είναι χαρούμενα και αρμονικά συνδεδεμένα. Στην κάρτα του Ήλιου έχουμε την γέννηση μιας καινούργιας συνειδητότητας που εκφράζεται από το χορό των παιδιών ανάμεσα στα γιορτινά χρώματα της φύσης, αλλά και κάτω από την ευλογία ενός λαμπρού Ήλιου. Για να ξαναγίνει παιδί ο άνθρωπος, πρέπει να περάσει από πολλές δοκιμασίες, για να αναγνωρίσει τη σοφία που κρύβεται στην αθωότητα και απλότητα ενός παιδιού. Επίσης ο Ήλιος είναι ζωοδότης, αλλά μπορεί να γίνει και πολύ σκληρός τιμωρός σε όποιον τον προσεγγίσει απροετοίμαστος. Όλες οι δοκιμασίες αποσκοπούν σε αυτήν την αφαίρεση καθετί περιττού, ώστε να μείνει το πιο αγνό και γνήσιο κομμάτι του εαυτού που θα γιορτάσει ανέμελο την αναγέννηση του.  ",
            " ~ Η Κρίση ~ Η ανάγκη του συμβολικού θανάτου του παλιού εαυτού, προκειμένου ο άνθρωπος να αποκτήσει ανώτερη συνειδητότητα, αναφέρεται σε πολλές αρχαίες παραδόσεις. Έτσι όποιος εγκαταλείψει τα εγκόσμια αγαθά, αγνοήσει τις εφήμερες απολαύσεις και σκοτώσει τον εγωισμό του, είναι σίγουρο ότι θα υποφέρει πολύ και σ' όλα τα επίπεδα. Ταυτόχρονα, όμως, θα κάνει χώρο στην καρδιά του για τη θεϊκή παρουσία, αφού αυτό θα είναι το μοναδικό στήριγμα που θα του έχει απομείνει. Αυτή η παρουσία θα τον μεταμορφώσει εσωτερικά και βέβαια μια τέτοια μεταμόρφωση θα εκδηλωθεί αργά ή γρήγορα στον εξωτερικό κόσμο. Τουλάχιστον, έτσι, διδάσκουν οι άγιοι όλων των αιώνων. Συνεπώς, δεν χρειάζεται να περιμένουμε τη Δευτέρα Παρουσία για να ζήσουμε μια ανώτερη ζωή, αφού ο άνθρωπος είναι φτιαγμένος με προδιαγραφές πολύ ανώτερες από τη συμβατική ζωή που ζει. Ούτε χρειάζεται να περιμένουμε αυτήν τη μέρα της Κρίσης, για να μάθουμε αν θα είμαστε με τους δίκαιους ή του αδίκους, αφού οι πράξεις όπως και οι σκέψεις μας διαμορφώνουν τη ζωή που ζούμε κάθε μέρα κάνοντάς την παράδεισο ή κόλαση. Πρέπει να επιτευχθεί η προσωπική μεταμόρφωση συνδέοντας το συνειδητό με το ασυνείδητο. ",
            " ~ Ο Κόσμος ~ Η Ουσία του Κόσμου, ο Κόσμος των Ιδεών, η συνειδητοποίηση του αληθινού κόσμου, η Αυτοπραγμάτωση, η Φώτιση. Το ταξίδι τελειώνει με επιτυχία σε όλες τις δοκιμασίες για μια ανώτερη πραγματικότητα. Όλα τα αντίθετα, αρσενικό - θηλυκό, λογική - συναίσθημα, σκέψη - δράση, συνθέτονται αρμονικά, αντί να αντιμάχονται το ένα το άλλο. Η μορφή είναι σχεδόν γυμνή, δεν έχει τίποτα να κρύψει και παρουσιάζει τη γυμνή αλήθεια. Δεν έχει το άλλοθι της άγνοιας, ούτε χρειάζεται εξωτερικά ερεθίσματα, αφού η συνειδητότητά έχει ανεβεί σε ανώτερο επίπεδο. Κίνηση συνειδητή, έχοντας διανύσει με επιτυχία όλα τα προηγούμενα βήματα. "}

        Dim r As New Random
        Dim apanthsh As Integer
        apanthsh = r.Next(1, 22)


        Dim teleutaio_gramma As String
        teleutaio_gramma = TextBox1.Text.Substring(TextBox1.Text.Length - 1)
        Dim sex As String
        If RadioButton1.Checked Then
            sex = "ΑΝΔΡΑΣ"
        Else
            sex = "ΓΥΝΑΙΚΑ"
        End If

        If (teleutaio_gramma = "ς") Or (teleutaio_gramma = "Σ") Then
            sex = "ΑΝΔΡΑΣ"
        Else
            sex = "ΓΥΝΑΙΚΑ"
        End If
        Dim mystr As New System.Text.StringBuilder
        If sex = "ΑΝΔΡΑΣ" Then
            mystr.Append(TextBox1.Text.Remove(TextBox1.Text.Length - 1) & " λάβε γνώση! ")
            ' mystr.Append(tuxaies_apanthseis(apanthsh))
            ' TextBox2.Text = mystr.ToString
        End If

        If sex = "ΓΥΝΑΙΚΑ" Then
            mystr.Append(TextBox1.Text & " λάβε γνώση! ")
            ' mystr.Append(tuxaies_apanthseis(apanthsh))
            ' TextBox2.Text = mystr.ToString
        End If


        Dim Shuffler1, Shuffler2, Shuffler3, Shuffler4, Shuffler5, Shuffler6, Shuffler7, Shuffler8, Shuffler9 As New Integer

        Shuffler1 = r.Next(1, 22)
        PictureBox1.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler1.ToString())
        Do
            Shuffler2 = r.Next(1, 22)
        Loop Until (Shuffler1 <> Shuffler2)
        PictureBox2.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler2.ToString())
        Do
            Shuffler3 = r.Next(1, 22)
        Loop Until (Shuffler3 <> Shuffler1) And (Shuffler3 <> Shuffler2)
        PictureBox3.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler3.ToString())
        Do
            Shuffler4 = r.Next(1, 22)
        Loop Until (Shuffler4 <> Shuffler3) And (Shuffler4 <> Shuffler2) And (Shuffler4 <> Shuffler1)
        PictureBox4.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler4.ToString())
        Do
            Shuffler5 = r.Next(1, 22)
        Loop Until (Shuffler5 <> Shuffler4) And (Shuffler5 <> Shuffler3) And (Shuffler5 <> Shuffler2) And (Shuffler5 <> Shuffler1)
        PictureBox5.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler5.ToString()) 
        Do
            Shuffler6 = r.Next(1, 22)
        Loop Until (Shuffler6 <> Shuffler5) And (Shuffler6 <> Shuffler5) And (Shuffler6 <> Shuffler4) And (Shuffler6 <> Shuffler3) And (Shuffler6 <> Shuffler2) And (Shuffler6 <> Shuffler1)
        PictureBox6.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler6.ToString())
        Do
            Shuffler7 = r.Next(1, 22)
        Loop Until (Shuffler7 <> Shuffler6) And (Shuffler7 <> Shuffler5) And (Shuffler7 <> Shuffler4) And (Shuffler7 <> Shuffler3) And (Shuffler7 <> Shuffler2) And (Shuffler7 <> Shuffler1)
        PictureBox7.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler7.ToString())
        Do
            Shuffler8 = r.Next(1, 22)
        Loop Until (Shuffler8 <> Shuffler7) And (Shuffler8 <> Shuffler6) And (Shuffler8 <> Shuffler5) And (Shuffler8 <> Shuffler4) And (Shuffler8 <> Shuffler3) And (Shuffler8 <> Shuffler2) And (Shuffler8 <> Shuffler1)
        PictureBox8.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler8.ToString())
        Do
            Shuffler9 = r.Next(1, 22)
        Loop Until (Shuffler9 <> Shuffler8) And (Shuffler9 <> Shuffler7) And (Shuffler9 <> Shuffler6) And (Shuffler9 <> Shuffler5) And (Shuffler9 <> Shuffler4) And (Shuffler9 <> Shuffler3) And (Shuffler9 <> Shuffler2) And (Shuffler9 <> Shuffler1)
        PictureBox9.BackgroundImage = My.Resources.ResourceManager.GetObject("Card_" & Shuffler9.ToString())

        TextBox2.Text = mystr.ToString + " ___Παρελθόν___ " + tuxaies_apanthseis(Shuffler1) + " " + tuxaies_apanthseis(Shuffler2) + " " + tuxaies_apanthseis(Shuffler3) + " ___Παρόν___ " + tuxaies_apanthseis(Shuffler4) + " " + tuxaies_apanthseis(Shuffler5) + " " + tuxaies_apanthseis(Shuffler6) + " ___Μέλλον___ " + tuxaies_apanthseis(Shuffler7) + " " + tuxaies_apanthseis(Shuffler8) + " " + tuxaies_apanthseis(Shuffler9) + " "

    End Sub

    Private Sub Button2_Click(sender As Object, e As EventArgs) Handles Button2.Click
        My.Forms.Form1st.Text = Now.ToString
        My.Forms.Form1st.Show()
        Me.Close()
    End Sub

    Private Sub Button3_Click(sender As Object, e As EventArgs) Handles Button3.Click
        ' My.Forms.Form4th.Text = Now.ToString
        ' My.Forms.Form4th.Show()
        'Me.Close()
        Form4th.Timer1.Interval = 7000
        Form4th.Show()
    End Sub
End Class